<a href="https://colab.research.google.com/github/nurfnick/Cantrell_Jackson/blob/master/Tracy's%20hot%20mess%20of%20code1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pa
import numpy as np
import datetime as dt
from datetime import date as date
import time

# trucks want unique id (id is unique for each truck) want to grab the customer and the date used 
#tickets based on job details, multiple tickets/ invoice per and mults 'special projects' different categories etc.
#for each unique ticket and invoice, the type and number of job type of each customer.

In [131]:
url1 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_4.csv'
df1 = pa.read_csv(url1)
df1

        invoice_id  hs_customer  ...  ticket_item_type  details
0           179988            4  ...   job_description   1281.0
1           179987            4  ...   job_description   1281.0
2           179995            4  ...   job_description   1281.0
3           179978            4  ...   job_description   1281.0
4           180011            4  ...   job_description   1281.0
...            ...          ...  ...               ...      ...
187563      223637            4  ...   job_description      NaN
187564      223548            4  ...   job_description      NaN
187565      223544            4  ...   job_description      NaN
187566      223547            4  ...   job_description      NaN
187567      223546            4  ...   job_description      NaN

[187568 rows x 9 columns]

In [0]:
df1

        invoice_id  hs_customer  ...  ticket_item_type  details
0           179988            4  ...   job_description   1281.0
1           179987            4  ...   job_description   1281.0
2           179995            4  ...   job_description   1281.0
3           179978            4  ...   job_description   1281.0
4           180011            4  ...   job_description   1281.0
...            ...          ...  ...               ...      ...
187563      223637            4  ...   job_description      NaN
187564      223548            4  ...   job_description      NaN
187565      223544            4  ...   job_description      NaN
187566      223547            4  ...   job_description      NaN
187567      223546            4  ...   job_description      NaN

[187568 rows x 9 columns]

In [227]:
del i
del x
del j
del readable

NameError: ignored

In [230]:
for index, date in enumerate(df1['ticket_date']):
  readable = dt.datetime.fromtimestamp(date).strftime('%m%y')
  df1.at[index, 'readable'] = readable
print(df1)

        invoice_id  hs_customer  ...  details  readable
0           179988            4  ...   1281.0      0918
1           179987            4  ...   1281.0      0918
2           179995            4  ...   1281.0      0918
3           179978            4  ...   1281.0      0918
4           180011            4  ...   1281.0      1018
...            ...          ...  ...      ...       ...
187563      223637            4  ...      NaN      0119
187564      223548            4  ...      NaN      0119
187565      223544            4  ...      NaN      0119
187566      223547            4  ...      NaN      0119
187567      223546            4  ...      NaN      0119

[187568 rows x 10 columns]

In [199]:
for i in df1['ticket_date']:
  i = []
  x = []
  for i in readable:
    i = x
    readable = []
    readable = dt.datetime.fromtimestamp(x).strftime('%m%y')
print(len(readable))

0

In [232]:
#16, 18, 19, 5 are too big- zipped files.
#34,39,41,45 too big
# for customers 4 10 15 28
custnums = [4]
for n in range(len(custnums)):
  print('Customer '+str(custnums[n])+':')
  #read files
  url = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_'+str(custnums[n])+'.csv'
  df = pa.read_csv(url)
  #make date a number, make blanks = 0, readable upper/lower case, get rid of duplicates
  for index, date in enumerate(df['ticket_date']):
    readable = dt.datetime.fromtimestamp(date).strftime('%m%y')
    df.at[index, 'readable'] = readable
  values = {'invoice_id': 0, 'hs_customer': 0, 'invoice_total': 0, 'invoice_time': 0, 'ticket_id': 0, 'job_type': 0, 'ticket_date': 0,'ticket_item_type': 0, 'details': 0}
  df.fillna(value=values)
  dfnoNAN = df.fillna(value=values)
  dfnoduplicates = dfnoNAN.drop_duplicates()
  dfnoduplicates.columns = dfnoduplicates.columns.str.lower()
  #group by ticket date
  dfgroupdates = dfnoduplicates.groupby('readable')
  #grab one of the dates
  
  billdates = dfgroupdates.get_group('0918')
  #group by the job type
  billdatesjobtype = billdates.groupby('job_type')
  billdatessp = billdatesjobtype.get_group('Special Projects')
  customerdatessplen = len(billdatessp)
  customerdatesspmoney = round(sum(billdatessp['invoice_total']),2)
  if 'Water Hauling' in billdatesjobtype.groups.keys():
    billdateswh = billdatesjobtype.get_group('Water Hauling')
    customerdateswhlen = len(billdateswh)
    customerdateswhmoney = round(sum(billdateswh['invoice_total']),2)
  else:
    customerdateswhlen = 0
    customerdateswhmoney = 0
  if 'Flowback' in billdatesjobtype.groups.keys():
    billdatesfb = billdatesjobtype.get_group('Flowback')
    customerdatesfblen = len(billdatesfb)
    customerdatesfbmoney = round(sum(billdatesfb['invoice_total']),2)
    customerdateslentot = customerdatessplen + customerdatesfblen + customerdateswhlen
    customerdatesmoneytot = customerdatesspmoney + customerdatesfbmoney + customerdateswhmoney
    print(f'Bill date Summary:\n Special Projects Tickets Count: {customerdatessplen:,.0f}\n Cash: ${customerdatsspmoney:,.2f}\n Water Hauling Ticket Count: {customerdateswhlen:,.0f}\n Cash: ${customerdateswhmoney:,.2f}\n Flowback Ticket Count: {customerdatesfblen:,.0f}\n Cash: ${customerdatesfbmoney:,.2f}\n Total Customer Ticket Count: {customerdateslentot:,.0f}\n Cash: ${customerdatesmoneytot:,.2f}')
  else:
    customerdateslentot = customerdatessplen + customerdateswhlen
    customerdatesmoneytot = customerdatesspmoney + customerdateswhmoney
    print(f'Bill date Summary:\n Special Projects Tickets Count: {customerdatessplen:,.0f}\n Cash: ${customerdatesspmoney:,.2f}\n Water Hauling Ticket Count: {customerdateswhlen:,.0f}\n Cash: ${customerdateswhmoney:,.2f}\n No Flowback tickets\n Total Customer Ticket Count: {customerdateslentot:,.0f}\n Cash: ${customerdatesmoneytot:,.2f}')
  print('\n')

Customer 4:
Bill date Summary:
 Special Projects Tickets Count: 147
 Cash: $275,876.23
 Water Hauling Ticket Count: 2,315
 Cash: $15,831,594.06
 No Flowback tickets
 Total Customer Ticket Count: 2,462
 Cash: $16,107,470.29